Tekla.Structures.Analysis.AnalysisArea
The AnalysisArea class contains information related to analysis areas.

Tekla.Structures.Analysis.AnalysisArea._Label
The label of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._AnalysisType
The analysis type of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._Material
The material of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._Profile
The profile of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._Thickness
The thickness of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._Area
The area polygon of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._AreaHoles
The area holes of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._InnerPositions
The inner positions of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._RigidDiaphragm
The rigid diaphragm of the analysis area.

Tekla.Structures.Analysis.AnalysisArea._AnalysisDesignCode
The design parameters of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Label
The label of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.AnalysisType
The analysis type of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Material
The material of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Profile
The profile of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Thickness
The thickness of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Area
The area polygon of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.AreaHoles
The area holes of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.InnerPositions
The inner positions of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.RigidDiaphragm
The rigid diaphragm of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.AnalysisDesignCode
The design code of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Insert
Inserts an analysis area.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisArea.Select
Selects an analysis area.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisArea.Modify
Modifies an analysis area.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisArea.Delete
Deletes an analysis area.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisArea.GetAreaHoles
Gets the area holes of the analysis area.
Returns: The area holes of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.GetInnerPositions
Gets the inner positions of the analysis area.
Returns: The inner positions of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Add(Tekla.Structures.Analysis.AnalysisPosition)
Adds position to analysis area (outline). Also adds edge.

Tekla.Structures.Analysis.AnalysisArea.AddHole(Tekla.Structures.Analysis.AnalysisAreaPolygon)
Adds hole to analysis area.

Tekla.Structures.Analysis.AnalysisArea.AddInner(Tekla.Structures.Analysis.AnalysisPosition)
Adds inner position to analysis area.

Tekla.Structures.Analysis.AnalysisArea.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisArea.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisArea.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisArea.DeleteInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisArea.CreateAreaHoleEnumerator
Create area hole enumerator.

Tekla.Structures.Analysis.AnalysisArea.CreateInnerPositionEnumerator
Create inner position enumerator.

Tekla.Structures.Analysis.AnalysisArea.CollectData
Collects additional data.

Tekla.Structures.Analysis.AnalysisArea.AddPosition(Tekla.Structures.Analysis.AnalysisPosition)
Adds position to analysis area (outline).
Also adds edge.

Tekla.Structures.Analysis.AnalysisArea.AddHoleAreaPolygon(Tekla.Structures.Analysis.AnalysisAreaPolygon)
Adds hole to analysis area.

Tekla.Structures.Analysis.AnalysisArea.AddInnerPosition(Tekla.Structures.Analysis.AnalysisPosition)
Adds inner position to analysis area.